# Extract, Transform Data

## Extract

In [1]:
#Import Dependenices
import pandas as pd

### Bring the data in

In [3]:
#Spreadsheet 1 (online)
csv_file = "../resources/australia online turnover.csv"
online_raw = pd.read_csv(csv_file)
online_raw.head()

,Unnamed: 0,Turnover; Total Sales (State); Online Food Retailing ;,Turnover; Total Sales (State); Online Non-Food Retailing ;,Turnover Sales; Total (State); Online Total (Industry) ;,Turnover; Total Sales (State); Online Food Retailing ;.1,Turnover; Total Sales (State); Online Non-Food Retailing ;.1,Turnover Sales; Total (State); Online Total (Industry) ;.1,Turnover; Total Sales (State); Online Food Retailing ;.2,Turnover; Total Sales (State); Online Non-Food Retailing ;.2,Turnover Sales; Total (State); Online Total (Industry) ;.2
0,Unit,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions
1,Series Type,Original,Original,Original,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Trend,Trend,Trend
2,Data Type,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1

In [4]:
#Spreasheet 2 (retail)
csv_file = "../resources/turnover by state.csv"
retail_raw = pd.read_csv(csv_file)
retail_raw.head()

,Unnamed: 0,Turnover ; New South Wales ; Total (Industry) ;,Turnover ; Victoria ; Total (Industry) ;,Turnover ; Queensland ; Total (Industry) ;,Turnover ; South Australia ; Total (Industry) ;,Turnover ; Western Australia ; Total (Industry) ;,Turnover ; Tasmania ; Total (Industry) ;,Turnover ; Northern Territory ; Total (Industry) ;,Turnover ; Australian Capital Territory ; Total (Industry) ;,Turnover ; Total (State) ; Total (Industry) ;,...,Turnover ; Total (State) ; Total (Industry) ;.1,Turnover ; New South Wales ; Total (Industry) ;.2,Turnover ; Victoria ; Total (Industry) ;.2,Turnover ; Queensland ; Total (Industry) ;.2,Turnover ; South Australia ; Total (Industry) ;.2,Turnover ; Western Australia ; Total (Industry) ;.2,Turnover ; Tasmania ; Total (Industry) ;.2,Turnover ; Northern Territory ; Total (Industry) ;.2,Turnover ; Australian Capital Territory ; Total (Industry) ;.2,Turnover ; Total (State) ; Total (Industry) ;.2
0,Unit,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,...,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions
1,Series Type,Original,Original,Original,Original,Original,Original,Original,Original,Original,...,Seasonally Adjusted,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend
2,Data Type,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,...,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month,...,Month,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1

## Transform

In [5]:
# Create a filtered online dataframe from specific columns
online_columns = ["Unnamed: 0", "Turnover; Total Sales (State); Online Food Retailing ;.1", "Turnover; Total Sales (State); Online Non-Food Retailing ;.1", "Turnover Sales; Total (State); Online Total (Industry) ;.1"]
online_df = online_raw[online_columns].copy()
online_df.head()

,Unnamed: 0,Turnover; Total Sales (State); Online Food Retailing ;.1,Turnover; Total Sales (State); Online Non-Food Retailing ;.1,Turnover Sales; Total (State); Online Total (Industry) ;.1
0,Unit,$ Millions,$ Millions,$ Millions
1,Series Type,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted
2,Data Type,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month
4,Collection Month,1,1,1

In [6]:
# Create a filtered retail dataframe from specific columns
retail_columns = ["Unnamed: 0", "Turnover ;  Total (State) ;  Total (Industry) ;.1"]
retail_df = retail_raw[retail_columns].copy()
retail_df.head()

         Unnamed: 0 Turnover ;  Total (State) ;  Total (Industry) ;.1
0              Unit                                        $ Millions
1       Series Type                               Seasonally Adjusted
2         Data Type                                              FLOW
3         Frequency                                             Month
4  Collection Month                                                 1

In [7]:
# Remove unnecessary rows from online data
online_df = online_df.iloc[9:]
online_df.head()

,Unnamed: 0,Turnover; Total Sales (State); Online Food Retailing ;.1,Turnover; Total Sales (State); Online Non-Food Retailing ;.1,Turnover Sales; Total (State); Online Total (Industry) ;.1
9,Jul-2013,139.5,331.4,470.9
10,Aug-2013,146.7,329.6,476.3
11,Sep-2013,139.7,322.7,462.4
12,Oct-2013,127.9,351.6,479.5
13,Nov-2013,138.5,388.1,526.6

In [8]:
# Remove unnecessary rows from retail data
retail_df = retail_df.iloc[9:]
retail_df.head()

   Unnamed: 0 Turnover ;  Total (State) ;  Total (Industry) ;.1
9    Apr-1982                                            3518.7
10   May-1982                                            3527.7
11   Jun-1982                                            3561.5
12   Jul-1982                                            3553.9
13   Aug-1982                                            3581.8

In [9]:
#Rename columns for online data
online_df = online_df.rename(columns={"Unnamed: 0": "date",
                                        "Turnover; Total Sales (State); Online Food Retailing ;.1": "online_food_turnover",
                                        "Turnover; Total Sales (State); Online Non-Food Retailing ;.1": "online_nonfood_turnover",
                                        "Turnover Sales; Total (State); Online Total (Industry) ;.1": "online_total_turnover"})
online_df.head()

,date,online_food_turnover,online_nonfood_turnover,online_total_turnover
9,Jul-2013,139.5,331.4,470.9
10,Aug-2013,146.7,329.6,476.3
11,Sep-2013,139.7,322.7,462.4
12,Oct-2013,127.9,351.6,479.5
13,Nov-2013,138.5,388.1,526.6

In [10]:
#Rename columns for retail data
retail_df = retail_df.rename(columns={"Unnamed: 0": "date",
                                        "Turnover ;  Total (State) ;  Total (Industry) ;.1": "total_revenue_turnover"})
retail_df.head()

        date total_revenue_turnover
9   Apr-1982                 3518.7
10  May-1982                 3527.7
11  Jun-1982                 3561.5
12  Jul-1982                 3553.9
13  Aug-1982                 3581.8

In [11]:
#Look for the row that has July 2013 as its date value
retail_df[retail_df["date"] == "Jul-2013"]

         date total_revenue_turnover
384  Jul-2013                22042.6

In [12]:
# Remove all values before July 2013 for retailColumn_df 
retail_df = retail_df.iloc[375:]
retail_df.head()

         date total_revenue_turnover
384  Jul-2013                22042.6
385  Aug-2013                22204.7
386  Sep-2013                22356.5
387  Oct-2013                22431.6
388  Nov-2013                22630.9

In [13]:
#Join tables
combined_df = pd.merge(online_df, retail_df, on='date')
combined_df

,date,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jul-2013,139.5,331.4,470.9,22042.6
1,Aug-2013,146.7,329.6,476.3,22204.7
2,Sep-2013,139.7,322.7,462.4,22356.5
3,Oct-2013,127.9,351.6,479.5,22431.6
4,Nov-2013,138.5,388.1,526.6,22630.9
...,...,...,...,...,...
87,Oct-2020,866.5,2215.9,3082.4,29601.6
88,Nov-2020,813.1,2223.3,3036.4,31571.4
89,Dec-2020,864.1,2107.2,2971.3,30450.9
90,Jan-2021,903.9,2117.1,3021.0,30538.5
91,Feb-2021,892.8,2060.6,2953.4,30300.6

In [14]:
#Split the date column into month and year for easy plotting
combined_df[['month','year']] = combined_df.date.str.split("-",expand=True,)
combined_df

,date,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover,month,year
0,Jul-2013,139.5,331.4,470.9,22042.6,Jul,2013
1,Aug-2013,146.7,329.6,476.3,22204.7,Aug,2013
2,Sep-2013,139.7,322.7,462.4,22356.5,Sep,2013
3,Oct-2013,127.9,351.6,479.5,22431.6,Oct,2013
4,Nov-2013,138.5,388.1,526.6,22630.9,Nov,2013
...,...,...,...,...,...,...,...
87,Oct-2020,866.5,2215.9,3082.4,29601.6,Oct,2020
88,Nov-2020,813.1,2223.3,3036.4,31571.4,Nov,2020
89,Dec-2020,864.1,2107.2,2971.3,30450.9,Dec,2020
90,Jan-2021,903.9,2117.1,3021.0,30538.5,Jan,2021
91,Feb-2021,892.8,2060.6,2953.4,30300.6,Feb,2021

In [15]:
# Re-arrange columns
combined_df = combined_df[['date', 'year', 'month', 'online_food_turnover', 'online_nonfood_turnover', 'online_total_turnover', 'total_revenue_turnover']]
combined_df

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9
...,...,...,...,...,...,...,...
87,Oct-2020,2020,Oct,866.5,2215.9,3082.4,29601.6
88,Nov-2020,2020,Nov,813.1,2223.3,3036.4,31571.4
89,Dec-2020,2020,Dec,864.1,2107.2,2971.3,30450.9
90,Jan-2021,2021,Jan,903.9,2117.1,3021.0,30538.5
91,Feb-2021,2021,Feb,892.8,2060.6,2953.4,30300.6

In [16]:
#Look for the row that has Jan 2020 as its date value
combined_df[combined_df["date"] == "Jan-2020"]

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
78,Jan-2020,2020,Jan,513.8,1341.3,1855.0,27608.3

In [17]:
# Create data frame pre-covid for regression
df_covid = combined_df.iloc[:78,:]

# Create data frame post-covid for regression
df_post_covid = combined_df.iloc[78:,:]

In [18]:
#check dataframe
df_covid.tail()

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
73,Aug-2019,2019,Aug,461.0,1287.9,1749.0,27543.5
74,Sep-2019,2019,Sep,478.9,1297.3,1776.2,27589.2
75,Oct-2019,2019,Oct,518.8,1289.3,1808.1,27635.0
76,Nov-2019,2019,Nov,493.0,1325.5,1818.5,27895.6
77,Dec-2019,2019,Dec,490.4,1428.6,1919.1,27747.2

In [19]:
#check dataframe
df_post_covid.head()

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
78,Jan-2020,2020,Jan,513.8,1341.3,1855.0,27608.3
79,Feb-2020,2020,Feb,548.5,1388.1,1936.6,27775.7
80,Mar-2020,2020,Mar,525.1,1673.9,2199.0,30033.3
81,Apr-2020,2020,Apr,603.2,2191.1,2794.3,24816.7
82,May-2020,2020,May,713.6,2157.2,2870.7,28940.1

## Save cleaned dataframe as csv file

In [20]:
combined_df.to_csv('../resources/data.csv',index = False, header=True)

In [21]:
df_covid.to_csv('../resources/covid.csv',index = False, header=True)

In [22]:
df_post_covid.to_csv('../resources/predict.csv',index = False, header=True)